{
  "navigation": {
    "home": "Главная",
    "team": "Наша команда",
    "problems": "Материалы",
    "gallery": "Галерея",
    "registration": "Регистрация",
    "changeLanguage": "Поменять язык"
  },
  "footer": {
    "socials": "Подписывайтесь",
    "resources": "Ресурсы",
    "materials": "Материалы",
    "about": "О нас",
    "gallery": "Галлерея",
    "ourTeam": "Наша команда",
    "rules": "Правила турнира"
  },
  "LocaleSwitcher": {
    "label": "Поменять язык",
    "locale": "{locale, select, ru {ru Русский} en {🇺🇸 Английский} kz {kz Казахский} other {Неопознанный}}"
  },
  "LocaleLayout": {
    "title": "Mathbattles"
  },
  "home": {
    "mathBattles": "Math Battles Community - синергия в цифрах, единство в умах",
    "numbers": "Мат Бои в цифрах",
    "kids": "Дети разного происхождения со всего Казахстана собираются здесь, в Алматы, чтобы разделить радость математики в сложном и веселом соревновании.",
    "onlineParticipants": "онлайн участников последнего турнира",
    "offlineParticipants": "офлайн участников последнего турнира",
    "fund": "общий призовой фонд, врученный победителям",
    "republicanOlympiadParticipants": "призёров Республиканской олимпиады по математике среди наших участников",
    "republicanOlympiadJury": "призёров Республиканской олимпиады по математике среди наших жюри",
    "ourMission": "Наша миссия",
    "about": "Сообщество Maths Battles — это команда талантливых участников олимпиад по математике и естественным наукам. Наше разнообразное и гостеприимное сообщество людей, решающих задачи, помогает ученикам и преподавателям проявить свои таланты, создавая инновационные решения STEM и EdTech.",
    "ourMissionContext": "Наша цель — распространить радость от изучения новых вещей и решения сложных задач среди как можно большего числа людей, организуя турниры, лагеря, онлайн и оффлайн курсы и уроки, которые доступны всем заинтересованным лицам. Мы собираем людей со всего Казахстана, чтобы способствовать обмену идеями и воспитать страсть к математике посредством дружеского соревнования. Наши мероприятия также полезны для членов нашей команды, и мы приглашаем всех заинтересованных математиков присоединиться к нам."
  },
  "our-team": {
    "about": "О нас",
    "weAre": "Мы — сообщество Maths Battles, крупная некоммерческая организация турниров.",
    "primaryGoal": "Наша основная цель — развивать командную работу и сотрудничество среди учеников, увлеченных математикой.",
    "goalsValues": "Наши Цели и Ценности",
    "popularization": "Популяризация",
    "collaboration": "Коллаборация",
    "fun": "Веселье",
    "popularizationContext": "Развитие олимпиадного движения среди школьников как средства воспитания интеллектуальной элиты страны и предоставления возможностей для детей.",
    "collaborationContext": "Поддержка взаимодействия и обмена опытом между лучшими умами страны посредством командной работы и сотрудничества внутри команд, организаторов и волонтеров.",
    "funContext": "Несмотря на то, что соревнование всегда является напряженным событием, команда организаторов турнира старается уменьшить напряжение для всех участников и объединить веселье и математику!",
    "ourTeam": "Наша команда"
  },
  "gallery": {
    "gallery": "Галерея",
    "selection": "Подборка фотографий с наших мероприятий."
  },
  "registration": {
    "registration": "Регистрационная форма на Алматинские Математические Бои 2025",
    "registrationContext": "Прежде чем заполнять эту форму, убедитесь, что вы прочитали и поняли правила турнира. Вы можете отредактировать свой ответ после заполнения формы через письмо от Google Forms, которое будет отправлено на вашу электронную почту. Обратите внимание, что количество участников должно быть либо 4, либо 5."
  },
  "problems": {
    "inDevelopment": "In development",
    "notReady": "Problems page is not ready yet. Come later",
    "iSwear": "I swear there would be a lot to find"
  },
  "notFound": {
    "missing": "Страница не найдена",
    "missingContext": "К сожалению, мы не можем найти эту страницу."
  }
}
